-- Вывести название и стоимость в USD одного самого дорогого товара
SELECT ProductName, Price * 1.15 AS Price_in_USD
FROM Products
ORDER BY Price DESC
LIMIT 1;
-- _________________________________________________________________________
-- Вывести два самых дешевых товара из категории 1
SELECT *
FROM Products
WHERE CategoryID = 1
ORDER BY Price
LIMIT 2;
-- _________________________________________________________________________
-- Удалить товары с ценой менее 50 EUR
DELETE FROM Products
WHERE Price < 50;
-- _________________________________________________________________________
-- Очистить поле ContactName у всех клиентов не из China
UPDATE Customers
SET ContactName = ''
WHERE Country <> 'China';
-- _________________________________________________________________________
-- Применить ко всем товарам постоянную скидку в 15%
UPDATE Products
SET Price = Price * 0.85;
-- _________________________________________________________________________
-- Вывести товар, который находится на третьем месте среди самых дорогих
SELECT ProductName
FROM Products
ORDER BY Price DESC
LIMIT 1 OFFSET 2;
-- _________________________________________________________________________